jimmywong2003/nrf5281x_s113_uart_example/ble_app_uart_s113_libuarte/main.c
APP_TIMER_DEF(m_battery_timer_id);                      /**< Battery measurement timer. */

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);                                   /**< BLE NUS service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;           /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];            /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX]; /**< Buffer for storing an encoded scan data. */

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
        .adv_data =
        {
                .p_data = m_enc_advdata,
                .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX
        },
        .scan_rsp_data =
        {
                .p_data = m_enc_scan_response_data,
                .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX

        }
};
static uint16_t m_conn_handle          = BLE_CONN_HANDLE_INVALID;                   /**< Handle of the current connection. */
static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;              /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
        {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};

typedef enum {
        APP_STATE_IDLE = 0,
        APP_STATE_ADVERTISING,
        APP_STATE_CONNECTED,
        APP_STATE_DISCONNECTED
} app_state_t;

typedef enum {
        APP_PHY_1M = 0,
        APP_PHY_2M,
        APP_PHY_MULTI,
        APP_PHY_CODED,
        APP_PHY_LIST_END
} app_phy_t;

typedef struct {
        app_state_t app_state;
        app_phy_t phy;
} app_display_content_t;

app_display_content_t m_application_state = {0};

#define LIBUARTE_DATA_LENGTH (NRF_SDH_BLE_GATT_MAX_MTU_SIZE-3)
#define LIBUARTE_BLOCK_LENGTH  10

NRF_LIBUARTE_ASYNC_DEFINE(libuarte, 0, 2, 0, NRF_LIBUARTE_PERIPHERAL_NOT_USED, LIBUARTE_DATA_LENGTH, LIBUARTE_BLOCK_LENGTH);

typedef struct buffer_s {
        uint8_t data_array[LIBUARTE_DATA_LENGTH];
        uint8_t len;
} buffer_t;

NRF_QUEUE_DEF(buffer_t, m_buf_queue, LIBUARTE_BLOCK_LENGTH, NRF_QUEUE_MODE_OVERFLOW);

// void libuart_event_handler(void * context, nrf_libuarte_async_evt_t * p_evt)
// {
//         nrf_libuarte_async_t * p_libuarte = (nrf_libuarte_async_t *)context;
//         ret_code_t ret, err_code;
//
//         switch (p_evt->type)
//         {
//         case NRF_LIBUARTE_ASYNC_EVT_ERROR:
//                 break;
//         case NRF_LIBUARTE_ASYNC_EVT_RX_DATA:
//
//                 NRF_LOG_INFO("ASYNC RX DATA");
//                 NRF_LOG_HEXDUMP_INFO(p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);
//
//                 uart_length = p_evt->data.rxtx.length;
//                 memcpy(uart_buffer, p_evt->data.rxtx.p_data, uart_length);
//
//                 NRF_LOG_INFO("\n\nfree_cnt = %d, buf_size = %d", p_libuarte->p_ctrl_blk->rx_free_cnt, p_libuarte->rx_buf_size);
//
//                 if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
//                 {
//                         err_code = ble_nus_data_send(&m_nus, uart_buffer, &uart_length, m_conn_handle);
//                         if ((err_code != NRF_ERROR_INVALID_STATE) &&
//                             (err_code != NRF_ERROR_RESOURCES) &&
//                             (err_code != NRF_ERROR_NOT_FOUND))
//                         {
//                                 APP_ERROR_CHECK(err_code);
//                         }
//                 }
//
//                 nrf_libuarte_async_rx_free(p_libuarte, p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);
//
//                 break;
//         case NRF_LIBUARTE_ASYNC_EVT_TX_DONE:
//                 NRF_LOG_DEBUG("NRF_LIBUARTE_ASYNC_EVT_TX_DONE");
//                 //         //if (m_loopback_phase)
//                 // {
//                 //         nrf_libuarte_async_rx_free(p_libuarte, p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);
//                 //         if (!nrf_queue_is_empty(&m_buf_queue))
//                 //         {
//                 //                 buffer_t buf;
//                 //                 ret = nrf_queue_pop(&m_buf_queue, &buf);
//                 //                 APP_ERROR_CHECK(ret);
//                 //                 UNUSED_RETURN_VALUE(nrf_libuarte_async_tx(p_libuarte, buf.p_data, buf.length));
//                 //         }
//                 // }
//                 break;
//         default:
//                 break;
//         }
// }

void libuart_event_handler(void * context, nrf_libuarte_async_evt_t * p_evt)
{
        nrf_libuarte_async_t * p_libuarte = (nrf_libuarte_async_t *)context;
        ret_code_t ret, err_code;
        uint16_t length;

        switch (p_evt->type)
        {
        case NRF_LIBUARTE_ASYNC_EVT_ERROR:
                break;
//        case NRF_LIBUARTE_ASYNC_EVT_RX_DATA_DMA_FULL:
//                NRF_LOG_INFO("NRF_LIBUARTE_ASYNC_EVT_RX_DATA_DMA_FULL");

        case NRF_LIBUARTE_ASYNC_EVT_RX_DATA:
                length = p_evt->data.rxtx.length;
                // NRF_LOG_INFO("UART Rx 1st bye: 0x%x total len: %d", p_evt->data.rxtx.p_data[0], length);
                // process RX buffer
                // here we send it out directly by BLE
                if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
                {
                        do
                        {
                                err_code = ble_nus_data_send(&m_nus, p_evt->data.rxtx.p_data, &length, m_conn_handle);
                                if ((err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
                                    (err_code != NRF_ERROR_NOT_FOUND))
                                {
                                        APP_ERROR_CHECK(err_code);
                                }
                        } while (err_code == NRF_ERROR_RESOURCES);
                }

