jimmywong2003/nrf5281x_s113_uart_example/ble_app_uart_s113_libuarte/main.c
                // required. release rx buffer to get prepared for the next rx. Release the buffer after the buffer is
                // processed
                nrf_libuarte_async_rx_free(p_libuarte, p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);

                // if (!nrf_queue_is_empty(&m_buf_queue))
                // {
                //         buffer_t buf;
                //         err_code = nrf_queue_pop(&m_buf_queue, &buf);
                //         APP_ERROR_CHECK(err_code);
                // }
                break;


        case NRF_LIBUARTE_ASYNC_EVT_TX_DONE:
                // NRF_LOG_INFO("NRF_LIBUARTE_ASYNC_EVT_TX_DONE");
                // nrf_libuarte_async_rx_free(p_libuarte, p_evt->data.rxtx.p_data, p_evt->data.rxtx.length);
                // if (!nrf_queue_is_empty(&m_buf_queue))
                // {
                //         buffer_t buf;
                //         ret = nrf_queue_pop(&m_buf_queue, &buf);
                //         APP_ERROR_CHECK(ret);
                //         //UNUSED_RETURN_VALUE(nrf_libuarte_async_tx(p_libuarte, buf.p_data, buf.length));
                // }
                // add tx_done app logic
                if (!nrf_queue_is_empty(&m_buf_queue))
                {
                        buffer_t buf;
                        err_code = nrf_queue_pop(&m_buf_queue, &buf);
                        APP_ERROR_CHECK(err_code);
                        UNUSED_RETURN_VALUE(nrf_libuarte_async_tx(p_libuarte, buf.data_array, buf.len));
                }
                break;

        default:
                break;
        }
}

/**
 * @brief Function for main application entry.
 */
void libuart_init(void)
{
        ret_code_t err_code;
        nrf_libuarte_async_config_t nrf_libuarte_async_config = {
                .tx_pin     = TX_PIN_NUMBER,
                .rx_pin     = RX_PIN_NUMBER,
                .baudrate   = NRF_UARTE_BAUDRATE_115200,
                .parity     = NRF_UARTE_PARITY_EXCLUDED,
                .hwfc       = NRF_UARTE_HWFC_DISABLED,
                .timeout_us = 100,
                .int_prio   = APP_IRQ_PRIORITY_LOW_MID
        };

        err_code = nrf_libuarte_async_init(&libuarte, &nrf_libuarte_async_config, libuart_event_handler, (void *)&libuarte);

        APP_ERROR_CHECK(err_code);

        nrf_libuarte_async_enable(&libuarte);

}


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
        app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *          This function will start the ADC.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
        UNUSED_PARAMETER(p_context);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);

        // Create battery timer.
        err_code = app_timer_create(&m_battery_timer_id,
                                    APP_TIMER_MODE_REPEATED,
                                    battery_level_meas_timeout_handler);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
        uint32_t err_code;
        ble_gap_conn_params_t gap_conn_params;
        ble_gap_conn_sec_mode_t sec_mode;

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

        err_code = sd_ble_gap_device_name_set(&sec_mode,
                                              (const uint8_t *) DEVICE_NAME,
                                              strlen(DEVICE_NAME));
        APP_ERROR_CHECK(err_code);

        memset(&gap_conn_params, 0, sizeof(gap_conn_params));

        gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
        gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
        gap_conn_params.slave_latency     = SLAVE_LATENCY;
        gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

        err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

        static uint8_t ble_data[LIBUARTE_DATA_LENGTH];
        if (p_evt->type == BLE_NUS_EVT_RX_DATA)
        {
                uint32_t err_code;
                NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
                NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
                // 250 is only used for demo. you can use other proper value instead
                memcpy(ble_data, p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
                err_code = nrf_libuarte_async_tx(&libuarte, ble_data, p_evt->params.rx_data.length);
                if (err_code == NRF_ERROR_BUSY)
                {
                        buffer_t buf;
                        buf.len = p_evt->params.rx_data.length;
                        memcpy(buf.data_array, p_evt->params.rx_data.p_data, buf.len);
                        err_code = nrf_queue_push(&m_buf_queue, &buf);
                        APP_ERROR_CHECK(err_code);
                }
                else
                {
                        APP_ERROR_CHECK(err_code);
                }
        }
        else if (p_evt->type == BLE_NUS_EVT_COMM_STARTED) //jimmy
        {
                // BLE Uart service is ready and connected to phone
                // start to send data to MCU for acknowledgment
                NRF_LOG_INFO("BLE_NUS_EVT_COMM_STARTED");
        }
        else if (p_evt->type == BLE_NUS_EVT_COMM_STOPPED) //jimmy
        {
                // UART service is disabled
                NRF_LOG_INFO("BLE_NUS_EVT_COMM_STOPPED");
        }
}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
        uint32_t err_code;
        ble_nus_init_t nus_init;
        nrf_ble_qwr_init_t qwr_init = {0};

