jimmywong2003/nrf5281x_s113_uart_example/ble_app_uart_s113_libuarte/main.c
        // Initialize Queued Write Module.
        qwr_init.error_handler = nrf_qwr_error_handler;

        err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
        APP_ERROR_CHECK(err_code);

        // Initialize NUS.
        memset(&nus_init, 0, sizeof(nus_init));

        nus_init.data_handler = nus_data_handler;

        err_code = ble_nus_init(&m_nus, &nus_init);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
        ret_code_t err_code;

        err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
        if (err_code == NRF_SUCCESS)
        {
                bsp_board_led_on(ADVERTISING_LED);
                bsp_board_led_off(CONNECTED_LED);
                m_application_state.app_state = APP_STATE_ADVERTISING;
        }
        else
        {
                APP_ERROR_CHECK(err_code);
        }
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
        uint32_t err_code;

        if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
        {
                err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
                APP_ERROR_CHECK(err_code);
        }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
        uint32_t err_code;
        ble_conn_params_init_t cp_init;

        memset(&cp_init, 0, sizeof(cp_init));

        cp_init.p_conn_params                  = NULL;
        cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
        cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
        cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
        cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
        cp_init.disconnect_on_fail             = false;
        cp_init.evt_handler                    = on_conn_params_evt;
        cp_init.error_handler                  = conn_params_error_handler;

        err_code = ble_conn_params_init(&cp_init);
        APP_ERROR_CHECK(err_code);
}


static void request_phy(uint16_t c_handle, uint8_t phy)
{
        ble_gap_phys_t phy_req;
        phy_req.tx_phys = phy;
        phy_req.rx_phys = phy;
        sd_ble_gap_phy_update(c_handle, &phy_req);
        NRF_LOG_INFO("Request to do the PHY update");

        switch (phy)
        {
        case BLE_GAP_PHY_1MBPS:
                bsp_board_led_on(PHY_1BMPS_LED);
                bsp_board_led_off(PHY_2BMPS_LED);
                break;
        case BLE_GAP_PHY_2MBPS:
                bsp_board_led_on(PHY_2BMPS_LED);
                bsp_board_led_off(PHY_1BMPS_LED);
                break;
        default:
                break;
        }
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
        ret_code_t err_code;
        ble_advdata_t advdata;
        ble_advdata_t srdata;
        ble_gap_adv_params_t adv_params;

        // Build and set advertising data.
        memset(&advdata, 0, sizeof(advdata));
        advdata.name_type = BLE_ADVDATA_FULL_NAME;
        advdata.include_appearance = false;
        advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

        memset(&srdata, 0, sizeof(srdata));
        srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
        srdata.uuids_complete.p_uuids  = m_adv_uuids;
        err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
        APP_ERROR_CHECK(err_code);

        err_code = ble_advdata_encode(&srdata, m_adv_data.scan_rsp_data.p_data, &m_adv_data.scan_rsp_data.len);
        APP_ERROR_CHECK(err_code);
        NRF_LOG_INFO("%s: m_application_state = %d", __func__, m_application_state.phy);
        // Set advertising parameters.
        memset(&adv_params, 0, sizeof(adv_params));

        if (m_application_state.phy == APP_PHY_CODED)
        {
                adv_params.primary_phy = BLE_GAP_PHY_CODED;
                adv_params.secondary_phy = BLE_GAP_PHY_CODED;
#if defined(S140)
                adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;
#else
                adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
#endif
        }
        else
        {
                adv_params.primary_phy = BLE_GAP_PHY_1MBPS;
                adv_params.secondary_phy = BLE_GAP_PHY_1MBPS;
                adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
        }
        adv_params.duration = APP_ADV_DURATION;
        adv_params.p_peer_addr = NULL;
        adv_params.filter_policy = BLE_GAP_ADV_FP_ANY;
        adv_params.interval = APP_ADV_INTERVAL;
        err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
        APP_ERROR_CHECK(err_code);
        err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_adv_handle, 0);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
        uint32_t err_code;
        ble_gap_evt_t const * const p_gap = &p_ble_evt->evt.gap_evt;


        switch (p_ble_evt->header.evt_id)
        {
        case BLE_GAP_EVT_CONNECTED:
                NRF_LOG_INFO("Connected");

                bsp_board_led_on(CONNECTED_LED);
                bsp_board_led_off(ADVERTISING_LED);

