jimmywong2003/nrf5281x_s113_uart_example/ble_app_uart_s113_libuarte/main.c
        switch (pin_no)
        {
        case PHY_BUTTON_1BMPS:
                if (button_action == APP_BUTTON_PUSH)
                {
                        if (m_application_state.phy != APP_PHY_1M)
                        {
                                request_phy(0, BLE_GAP_PHY_1MBPS);
                                NRF_LOG_INFO("Request to do the PHY update 1MBPS");
                                m_application_state.phy = APP_PHY_1M;
                        }
                }
                break;

        case PHY_BUTTON_2BMPS:
                if (button_action == APP_BUTTON_PUSH)
                {
                        if (m_application_state.phy != APP_PHY_2M)
                        {
                                request_phy(0, BLE_GAP_PHY_2MBPS);
                                NRF_LOG_INFO("Request to do the PHY update 2MBPS");
                                m_application_state.phy = APP_PHY_2M;
                        }
                }
                break;
        default:
                APP_ERROR_HANDLER(pin_no);
                break;
        }
}

/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
        ret_code_t err_code;

        //The array must be static because a pointer to it will be saved in the button handler module.
        static app_button_cfg_t buttons[] =
        {
                {PHY_BUTTON_1BMPS, false, BUTTON_PULL, button_event_handler},
                {PHY_BUTTON_2BMPS, false, BUTTON_PULL, button_event_handler},
        };

        err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                                   BUTTON_DETECTION_DELAY);
        APP_ERROR_CHECK(err_code);

        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);
}

// /**@brief   Function for handling app_uart events.
//  *
//  * @details This function will receive a single character from the app_uart module and append it to
//  *          a string. The string will be be sent over BLE when the last character received was a
//  *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
//  */
// /**@snippet [Handling the data received over UART] */
// void uart_event_handle(app_uart_evt_t * p_event)
// {
//         static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
//         static uint8_t index = 0;
//         uint32_t err_code;
//
//         switch (p_event->evt_type)
//         {
//         case APP_UART_DATA_READY:
//                 UNUSED_VARIABLE(app_uart_get(&data_array[index]));
//                 index++;
//
//                 if ((data_array[index - 1] == '\n') ||
//                     (data_array[index - 1] == '\r') ||
//                     (index >= m_ble_nus_max_data_len))
//                 {
//                         if (index > 1)
//                         {
//                                 NRF_LOG_DEBUG("Ready to send data over BLE NUS");
//                                 NRF_LOG_HEXDUMP_DEBUG(data_array, index);
//
//                                 do
//                                 {
//                                         uint16_t length = (uint16_t)index;
//                                         err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
//                                         if ((err_code != NRF_ERROR_INVALID_STATE) &&
//                                             (err_code != NRF_ERROR_RESOURCES) &&
//                                             (err_code != NRF_ERROR_NOT_FOUND))
//                                         {
//                                                 APP_ERROR_CHECK(err_code);
//                                         }
//                                 } while (err_code == NRF_ERROR_RESOURCES);
//                         }
//
//                         index = 0;
//                 }
//                 break;
//
//         case APP_UART_COMMUNICATION_ERROR:
//                 APP_ERROR_HANDLER(p_event->data.error_communication);
//                 break;
//
//         case APP_UART_FIFO_ERROR:
//                 APP_ERROR_HANDLER(p_event->data.error_code);
//                 break;
//
//         default:
//                 break;
//         }
// }
// /**@snippet [Handling the data received over UART] */


// /**@brief  Function for initializing the UART module.
//  */
// /**@snippet [UART Initialization] */
// static void uart_init(void)
// {
//         uint32_t err_code;
//         app_uart_comm_params_t const comm_params =
//         {
//                 .rx_pin_no    = RX_PIN_NUMBER,
//                 .tx_pin_no    = TX_PIN_NUMBER,
//                 .rts_pin_no   = RTS_PIN_NUMBER,
//                 .cts_pin_no   = CTS_PIN_NUMBER,
//                 .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
//                 .use_parity   = false,
// #if defined (UART_PRESENT)
//                 .baud_rate    = NRF_UART_BAUDRATE_115200
// #else
//                 .baud_rate    = NRF_UARTE_BAUDRATE_115200
// #endif
//         };
//
//         APP_UART_FIFO_INIT(&comm_params,
//                            UART_RX_BUF_SIZE,
//                            UART_TX_BUF_SIZE,
//                            uart_event_handle,
//                            APP_IRQ_PRIORITY_LOWEST,
//                            err_code);
//         APP_ERROR_CHECK(err_code);
// }
// /**@snippet [UART Initialization] */


// /**@brief Function for initializing the Advertising functionality.
//  */
// static void advertising_init(void)
// {
//         uint32_t err_code;
//         ble_advertising_init_t init;
//
//         memset(&init, 0, sizeof(init));
//
//         init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
//         init.advdata.include_appearance = false;
//         init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
//
//         init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
//         init.srdata.uuids_complete.p_uuids  = m_adv_uuids;
//
//         init.config.ble_adv_fast_enabled  = true;
//         init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
//         init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
//         init.evt_handler = on_adv_evt;
//
//         err_code = ble_advertising_init(&m_advertising, &init);
//         APP_ERROR_CHECK(err_code);
//
//         ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
// }


// /**@brief Function for initializing buttons and leds.
//  *
//  * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
//  */
// static void buttons_leds_init(bool * p_erase_bonds)
// {
//         bsp_event_t startup_event;
//
//         uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
//         APP_ERROR_CHECK(err_code);
//
//         err_code = bsp_btn_ble_init(NULL, &startup_event);
//         APP_ERROR_CHECK(err_code);
//
//         *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
// }

static void timers_start(void)
{
        // Start battery timer
        ret_code_t err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
#define FPU_EXCEPTION_MASK 0x0000009F

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
  #if defined (NRF52832_XXAA) || defined (NRF52840_XXAA)
        __set_FPSCR(__get_FPSCR()  & ~(FPU_EXCEPTION_MASK));
        (void) __get_FPSCR();
        NVIC_ClearPendingIRQ(FPU_IRQn);
  #endif
        app_sched_execute();
        if (NRF_LOG_PROCESS() == false)
        {
                nrf_pwr_mgmt_run();
        }
}


/**@brief Application main function.
 */
int main(void)
{
        bool erase_bonds;

        // Initialize.
        //uart_init();
        log_init();
        timers_init();
        buttons_init();

        //wdt_init();
        bsp_board_init(BSP_INIT_LEDS);

        //buttons_leds_init(&erase_bonds);
        power_management_init();
        ble_stack_init();
        scheduler_init();
        gap_params_init();
        gatt_init();
        services_init();

        m_application_state.phy = APP_PHY_2M;

        advertising_init();
        conn_params_init();

        // Start execution.
        //printf("\r\nUART started.\r\n");
        NRF_LOG_INFO("Debug logging for UART over RTT started.");

        libuart_init();

        advertising_start();

        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}


/**
 * @}
 */
